package Ovulam;

/*
火焰的攻击会受到布墙反弹
铅分裂,硫蜂群不能有效攻击T4T5空军, 废料分裂,爆混蜂群不能有效攻击T5空军
裂解重设子弹目标有1/12秒的间隔, 导致裂解无法应对大量的子弹
浪涌子弹的平均落点位置是浪涌到攻击目标的0.9距离
子弹击中特效有时候并不代表子弹的溅射, 比如爆混气旋的子弹溅射范围实际上跟泰坦差不多
对付泰坦最好的方法就是另一个泰坦

闪电实际上是一次生成大量的子弹, 因此闪电攻击对力墙的效果极佳
闪电生成的闪电子弹的数量是闪电长度的一半向下取整
持续性激光一秒造成12次攻击, 也就是说, 持续性激光要吃12次护甲, 龙王的激光单次伤害只有26
对于抛射炮子弹本体伤害, 冰雹与浪涌是20或者25, 飞鲨是20, 戟鲸是15, 泰坦是350
对于轰炸子弹本体伤害天垠是0, 雷霆是1, 力墙能够完全保护范围内的建筑不受伤害

龙王预估DPS为2.3K, 领主DPS为162, 但是领主不但能杀龙王还能剩一半血量
埃里克尔T4飞船与T5飞船本体的压制场范围一致, T5飞船炮弹的压制场范围直径等于再生投影对角线长度
压制场的视觉效果就是T4T5飞船中的圆球, T5飞船实际上有三个压制场, 并且两边的压制场不进行工作, 纯粹为了好看
水电反应的所有伤害在V8中将会受到护甲减免, 其他反应仍然是真实伤害
反应由作为影响因素的状态效果进行, 比如油火反应中, 打反应伤害的是石油
死星射击时,每隔4.375格产生一次最低5长度, 最高20长度, 伤害为50的闪电
硫火焰的DPS与海神差不多
空军单位坠落造成的溅射伤害半径是单位的碰撞体积半径的两倍(公式实际上就是一个接近2的函数)
空军单位坠落伤害是无视护甲, 能够贯穿的范围伤害, 建筑体积越大, 受到的伤害越多

龙王主炮无法加速瘤变反应堆, 因为瘤变反应堆压根不能被超速, 所有的发热建筑也都无法被超速
埃里克尔冲击钻头的挖矿效率不如赛普罗的气动钻头, 要的水也是气动的三倍多, 而且耗电也多
一个小石墨厂配4个煤炭机械钻头, 一个玻璃厂配5个沙机械钻头, 两个小硅厂配15个沙机械钻头
埃里克尔一个电解厂供2个T2厂的氢, 一个布热的氮气正好供一个T3厂
组装厂需要的氰气效率是400%氰厂(坦克是300%), T5需要的碳化物速率是600%碳化物厂
矿渣热合金中, 一半多的矿渣用来制热
将煤炭转石墨再供电弧硅, 对煤炭和沙的利用率是小硅的两倍
载荷装载器和卸载器能够运输3*3的载荷, 并且可以通过激光节点或者电池传输电力
钻头不加水, 等于没加水, 钻机不加氢,等于没加氢
 */