    //第一阶段
    //todo 1 多载荷方块(✓
    //todo 2 巨构---迫击炮(✓
    //todo 2.5 迫击炮炮弹（✓
    //todo 3 巨构---多载荷多合成工厂(✓
    //todo 3。5 多载荷多合成工厂 移入，移动，移出（✓

    //3 多合成载荷工厂：石墨烯，紫晶，（孢子？）（✗） //有了多载荷工厂，不需要载荷工厂了

    //todo 4 重画 块，载荷矿石 (✓
    //todo 5 BOSS和免疫盾机制 （√
    //todo 6 核心 与 远程链接构造机，装载（√
    //todo 7 第一张地图 冥界入口（

    //第二阶段
    //todo 大布工厂 (√
    //todo 原版敌人变种

    //todo 巨构---拆解/破碎厂

    //todo 全息力墙(√
    //todo 真正的“物品方块” (√
    //todo 冥府环境块
    //todo 逻辑控制多合成工厂的配方 （√
    //todo 自定义地图规则 与 方块的过载模式
    //todo 第二张地图


    //未来
    //修复物品堆炮台子弹问题
    //todo 穿透子弹 （√
    //todo 竞争AI
    //todo 复活单位 （√
    //todo 多建造方块 （√
    //todo 亚空间
    //todo 核心机升级台 （104  （√
    //todo 发电单位
    //todo 创世神T6海军海辅 和 辅助机
    //todo 裂解光线 与 烧蚀盾 （√
    //todo “核心”单位
    //todo 巨构---斗轮挖掘站？
    //todo TMI配方 (√
    //todo 动态变化BUFF
    //todo 遗迹
    //todo 单位地雷能力
    //todo 帧伤弹追踪 （√
    //todo 挨打生电墙
    //todo 迷雾伪装单位
    //todo 存档功能
    //todo 运输海军的水箱

    //todo 概率工厂
